stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Src/stm32wbaxx_hal_flash_ex.c
  return status;
}

/**
  * @brief  Return the value of the security inversion.
  *
  * @retval  It indicates the flash security state configuration
  *          This return value can be one of the following values:
  *            @arg FLASH_SEC_INV_DISABLE: Security state of Flash is not inverted
  *            @arg FLASH_SEC_INV_ENABLE: Security state of Flash is inverted
  */
uint32_t HAL_FLASHEx_GetSecInversion(void)
{
  return (FLASH->SECCR1 & FLASH_SECCR1_INV);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Enable the Power-down Mode for Flash Banks
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_EnablePowerDown()
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart;

  /* Check PD and PDREQ bits (Flash is not in power-down mode and not being
     already under power-down request) */
  if ((FLASH->NSSR & FLASH_NSSR_PD) != 0U)
  {
    status = HAL_ERROR;
  }
  else if ((FLASH->ACR & FLASH_ACR_PDREQ) != 0U)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Unlock PDREQ bit */
    WRITE_REG(FLASH->PDKEYR, FLASH_PDKEY1);
    WRITE_REG(FLASH->PDKEYR, FLASH_PDKEY2);

    /* Set PDREQ in FLASH_ACR register */
    SET_BIT(FLASH->ACR, FLASH_ACR_PDREQ);

    /* Check PD1 bit */
    tickstart = HAL_GetTick();
    while (((FLASH->NSSR & FLASH_NSSR_PD) != FLASH_NSSR_PD))
    {
      if ((HAL_GetTick() - tickstart) > FLASH_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return status;
}

/**
  * @brief  Configuration of the Low-Power read Mode.
  *
  * @param  ConfigLPM indicate the Low-Power read Mode configuration.
  *         This parameter can be one of the following values:
  *           @arg FLASH_LPM_ENABLE: Flash is in low-power read mode
  *           @arg FLASH_LPM_DISABLE: Flash is in normal read mode
  *
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_ConfigLowPowerRead(uint32_t ConfigLPM)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_FLASH_CFGLPM(ConfigLPM));

  /* Set LPM Bit in FLASH_ACR register */
  MODIFY_REG(FLASH->ACR, FLASH_ACR_LPM, ConfigLPM);

  /* Check that low power read mode has been activated */
  if (READ_BIT(FLASH->ACR, FLASH_ACR_LPM) != ConfigLPM)
  {
    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Return the value of the Low-Power read Mode.
  *
  * @retval  It indicates the flash low-power read mode configuration
  *          This return value can be one of the following values:
  *            @arg FLASH_LPM_ENABLE: Flash is in low-power read mode
  *            @arg FLASH_LPM_DISABLE: Flash is in normal read mode
  */
uint32_t HAL_FLASHEx_GetLowPowerRead(void)
{
  return (FLASH->ACR & FLASH_ACR_LPM);
}

/**
  * @brief  Return the on-going Flash Operation. After a system reset, return
  *         the interrupted Flash operation, if any.
  * @param  pFlashOperation [out] pointer to a FLASH_OperationTypeDef structure
  *                 that contains the Flash operation information.
  *
  * @retval None
  */
void HAL_FLASHEx_GetOperation(FLASH_OperationTypeDef *pFlashOperation)
{
  uint32_t opsr_reg = FLASH->OPSR;

  /* Get Flash operation Type */
  pFlashOperation->OperationType = opsr_reg & FLASH_OPSR_CODE_OP;

  /* Get Flash operation memory */
  pFlashOperation->FlashArea = opsr_reg & FLASH_OPSR_SYSF_OP;

  /* Get Flash operation address */
  pFlashOperation->Address = opsr_reg & FLASH_OPSR_ADDR_OP;
}

/**
  * @}
  */

/** @defgroup FLASHEx_Exported_Functions_Group3 Extended ECC operation functions
  *  @brief   Extended ECC operation functions
  *
@verbatim
 ===============================================================================
                  ##### Extended ECC operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the Extended FLASH
    ECC Operations.

@endverbatim
  * @{
  */
/**
  * @brief  Enable ECC correction interrupt
  * @note   ECC detection does not need to be enabled as directly linked to
  *         Non-Maskable Interrupt (NMI)
  * @retval None
  */
void HAL_FLASHEx_EnableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_ENABLE_IT(FLASH_IT_ECCC);
}

/**
  * @brief  Disable ECC correction interrupt
  * @retval None
  */
void HAL_FLASHEx_DisableEccCorrectionInterrupt(void)
{
  __HAL_FLASH_DISABLE_IT(FLASH_IT_ECCC);
}

/**
  * @brief  Get the ECC error information.
  * @param  pData Pointer to an FLASH_EccInfoTypeDef structure that contains the
  *         ECC error information.
  * @note   This function should be called before ECC bit is cleared
  *         (in callback function)
  * @retval None
  */
void HAL_FLASHEx_GetEccInfo(FLASH_EccInfoTypeDef *pData)
{
  uint32_t eccr;
  /* Check Null pointer */
  assert_param(pData != NULL);

  /* Get back information from ECC register */
  eccr = FLASH->ECCR;

  /* Retrieve and sort information */
  pData->Area = (eccr & FLASH_ECCR_SYSF_ECC);
  pData->Address = ((eccr & FLASH_ECCR_ADDR_ECC) << 3U);

  /* Add Base address depending on targeted area */
  if (pData->Area == FLASH_ECC_AREA_USER_BANK1)
  {
    pData->Address |= FLASH_BASE;
  }
  else
  {
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    pData->Address |= SYSTEM_FLASH_BASE_S;
#else
    pData->Address |= SYSTEM_FLASH_BASE_NS;
#endif /* __ARM_FEATURE_CMSE */
  }

  /* Set Master which initiates transaction. On WBA, it's necessary CPU1 */
  pData->MasterID = FLASH_ECC_MASTER_CPU1;
}

/**
  * @brief  Handle Flash ECC Detection interrupt request.
  * @note   On STM32WBA, this Irq Handler should be called in Non-Maskable Interrupt (NMI)
  *         interrupt subroutine.
  * @retval None
  */
void HAL_FLASHEx_ECCD_IRQHandler(void)
{
  /* Check ECC Detection Error */
  if ((FLASH->ECCR & FLASH_ECCR_ECCD) != 0U)
  {
    /* Call User callback */
    HAL_FLASHEx_EccDetectionCallback();

    /* Clear ECC detection flag in order to allow new ECC error record */
    SET_BIT(FLASH->ECCR, FLASH_ECCR_ECCD);
  }
}

/**
  * @brief  FLASH ECC Correction interrupt callback.
  * @retval None
  */
__weak void HAL_FLASHEx_EccCorrectionCallback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_FLASHEx_EccCorrectionCallback could be implemented in the user file
   */
}

/**
  * @brief  FLASH ECC Detection interrupt callback.
  * @retval None
  */
__weak void HAL_FLASHEx_EccDetectionCallback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_FLASHEx_EccDetectionCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @addtogroup FLASHEx_Private_Functions
  * @{
  */
/**
  * @brief  Mass erase of FLASH memory.
  * @retval None
  */
static void FLASH_MassErase()
{
  __IO uint32_t *reg_cr;


